create table book_types
(
    id        serial PRIMARY KEY,
    name      varchar(50),
    cnt       integer,
    fine      numeric(18, 2),
    day_count integer
);

create table clients
(
    id             serial PRIMARY KEY,
    first_name     varchar(20),
    last_name      varchar(20),
    pather_name    varchar(20),
    passport_seria varchar(20),
    passport_num   varchar(20)
);

create table books
(
    id      serial PRIMARY KEY,
    name    varchar(50),
    cnt     integer,
    type_id integer references book_types (id)
);

create table journal
(
    id        serial PRIMARY KEY,
    book_id   integer references books (id) on delete cascade,
    client_id integer references clients (id),
    date_beg  timestamp(3),
    date_end  timestamp(3),
    date_ret  timestamp(3)
);

insert into book_types (name, cnt, fine, day_count)
values ('common', 6, 10, 60),
       ('epic', 5, 50, 21),
       ('legendary', 5, 300, 7);

insert into books (name, cnt, type_id)
values ('Программист-прагматик: ваш путь к мастерству', 12, 1),
       ('Руководство по разработке алгоритмов', 14, 1),
       ('Рефакторинг: улучшение дизайна существующего кода', 15, 1),
       ('Шаблоны проектирования в первую очередь', 17, 1),
       ('x86 Assembly', 14, 1),
       ('Cg Programming', 17, 1),
       ('Введение в алгоритмы', 7, 2),
       ('Структура и интерпретация компьютерных программ', 8, 2),
       ('How to Make Software', 7, 2),
       ('Core JavaScript Guide', 9, 2),
       ('Introduction to Objective Caml', 8, 2),
       ('1000 Java Tips', 2, 3),
       ('Killer Game Programming in Java', 4, 3),
       ('Optimizing C ++', 4, 3),
       ('Etudes for Elixir', 4, 3),
       ('Ruby Users Guide', 4, 3),
       ('Мастер и Маргарита', 0, 3);

insert into clients (first_name, last_name, pather_name, passport_seria, passport_num)
values ('Кристофер', 'Андерсон', 'Робертович', '1234', '123456'),
       ('София', 'Исаева', 'Ильинична', '5678', '987654'),
       ('Ева', 'Кузина', 'Тимофеевна', '9012', '246813'),
       ('Ксения', 'Михайлова', 'Макаровна', '3456', '135792'),
       ('Демид', 'Сергеев', 'Макарович', '7890', '864209'),
       ('Светлана', 'Мартынова', 'Ивановна', '2345', '357951'),
       ('Владимир', 'Иванов', 'Леонидович', '6789', '642378'),
       ('Лев', 'Кузьмин', 'Олегович', '0123', '519438'),
       ('Ясмина', 'Петрова', 'Мироновна', '4567', '753951'),
       ('София', 'Малышева', 'Андреевна', '8901', '864209'),
       ('Арсений', 'Иванов', 'Даниилович', '5432', '123456'),
       ('Стефания', 'Маркелова', 'Яновна', '9876', '987654'),
       ('Дмитрий', 'Лукьянов', 'Дмитриевич', '3210', '135792'),
       ('Артём', 'Иванов', 'Тимофеевич', '7654', '753951'),
       ('Вера', 'Фомичева', 'Матвеевна', '1098', '366951'),
       ('Максим', 'Токарев', 'Михайлович', '1232', '523456');

insert into journal (book_id, client_id, date_beg, date_end, date_ret)
values (1, 1, '2023-01-01 6:00:00.200', '2023-03-01 6:00:00.200', '2023-01-14 16:10:25.352'),
       (2, 1, '2023-01-02 10:05:55.100', '2023-03-04 6:00:00.200', '2023-01-05 12:17:54.345'),
       (3, 1, '2023-01-03 19:04:13.152', '2023-03-04 6:00:00.200', '2023-02-01 14:54:45.245'),
       (4, 1, '2023-01-04 06:01:11.543', '2023-03-05 6:00:00.200', '2023-02-01 12:25:54.245'),
       (5, 1, '2023-01-04 16:10:25.352', '2023-03-05 6:00:00.200', '2023-03-01 23:23:23.230'),
       (15, 1, '2023-01-05 12:15:12.534', '2023-01-14 6:00:00.200', '2023-01-11 05:50:50.053'),
       (7, 1, '2023-01-05 12:16:34.430', '2023-01-26 6:00:00.200', '2023-01-11 15:55:50.053'),
       (8, 1, '2023-01-05 12:17:54.345', '2023-01-26 6:00:00.200', '2023-01-20 15:54:50.053'),
       (9, 1, '2023-01-07 14:01:05.534', '2023-01-29 6:00:00.200', '2023-01-20 15:51:50.053'),
       (12, 1, '2023-01-07 14:15:05.032', '2023-01-15 6:00:00.200', '2023-01-10 15:55:50.053'),
       (12, 2, '2023-01-07 16:43:20.340', '2023-01-15 6:00:00.200', '2023-01-10 15:55:40.153'),
       (5, 4, '2023-02-01 14:54:45.245', '2023-04-02 6:00:00.200', '2023-03-01 15:53:50.053'),
       (4, 5, '2023-02-01 12:25:54.245', '2023-04-02 6:00:00.200', '2023-03-01 14:20:34.234'),
       (3, 6, '2023-03-01 23:23:23.230', '2023-03-22 6:00:00.200', '2023-03-20 15:53:50.053'),
       (8, 6, '2023-03-01 05:55:50.053', '2023-03-29 6:00:00.200', '2023-03-20 15:53:50.053'),
       (9, 6, '2023-05-01 15:05:05.056', '2023-05-22 6:00:00.200', '2023-05-12 15:53:50.053'),
       (7, 7, '2023-12-01 20:50:05.058', '2023-12-22 6:00:00.200', '2023-12-20 15:53:50.053'),
       (1, 9, '2023-12-01 16:55:50.500', '2024-02-02 6:00:00.200', '2024-01-02 15:53:50.053'),
       (2, 9, '2023-12-01 13:54:50.570', '2024-02-02 6:00:00.200', '2024-01-02 15:53:50.053'),
       (1, 1, '2023-09-01 16:55:50.500', '2023-11-02 6:00:00.200', NULL),
       (3, 2, '2023-09-01 16:55:50.500', '2023-11-02 6:00:00.200', NULL),
       (11, 1, '2023-09-01 16:55:50.500', '2023-09-08 16:55:50.500', NULL),
       (10, 1, '2023-09-01 16:55:50.500', '2023-09-08 16:55:50.500', NULL),
       (4, 1, '2023-09-01 16:55:50.500', '2023-11-02 6:00:00.200', NULL);
